Revit 2015 API
ACADVersion Enumeration
 An enumerated type listing available AutoCAD versions, into which a file may be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public enum ACADVersion
Visual Basic
Public Enumeration ACADVersion
Visual C++
public enum class ACADVersion
Members
Member name | Description
R2000 |  AutoCAD 2000 file format.
R2004 |  AutoCAD 2004 file format.
R2007 |  AutoCAD 2007 file format.
R2010 |  AutoCAD 2010 file format.
Default |  The Autodesk Revit application's default export format.
R2013 |  AutoCAD 2013 file format.
See Also
Autodesk.Revit.DB Namespace